Tekla Open API Reference for Tekla Structures 2025
FacetedBrepWithNormals.Normals Property
 Gets or sets the vertex normal unit vectors
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector[] Normals { get; set; }
Public Property Normals As Vector()
	Get
	Set
Property Value
Type: Vector[]
See Also
Reference
FacetedBrepWithNormals Class
Tekla.Structures.Geometry3d Namespace